[Killed] StringLiteral
utils/username.js:3:46
 import User, { USERNAME_REGEX } from "../models/user.model.js";
 
-export const USERNAME_REQUIREMENTS_MESSAGE = "Username must be 3-20 characters and may include lowercase letters, numbers, or underscores.";
+export const USERNAME_REQUIREMENTS_MESSAGE = "";
 
 export const normalizeUsername = (value = "") =>
killedBy: username utils exports the requirements message
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "3-20"
Received string:    ""

[Killed] ArrowFunction
utils/username.js:5:34
 
 export const USERNAME_REQUIREMENTS_MESSAGE = "Username must be 3-20 characters and may include lowercase letters, numbers, or underscores.";
 
-export const normalizeUsername = (value = "") =>
-    value
-        .trim()
-        .toLowerCase()
-        .replace(/[^a-z0-9_]/g, "");
+export const normalizeUsername = () => undefined;
 
 export const stripToAllowedCharacters = (value = "") => normalizeUsername(value);
killedBy: username utils normalizes and strips unsupported characters
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "abc12_3"
Received: undefined

[NoCoverage] StringLiteral
utils/username.js:5:43
 
 export const USERNAME_REQUIREMENTS_MESSAGE = "Username must be 3-20 characters and may include lowercase letters, numbers, or underscores.";
 
-export const normalizeUsername = (value = "") =>
+export const normalizeUsername = (value = "Stryker was here!") =>
     value
         .trim()

[Killed] MethodExpression
utils/username.js:6:5
 export const USERNAME_REQUIREMENTS_MESSAGE = "Username must be 3-20 characters and may include lowercase letters, numbers, or underscores.";
 
 export const normalizeUsername = (value = "") =>
-    value
-        .trim()
-        .toLowerCase()
+    value.trim().toUpperCase()
         .replace(/[^a-z0-9_]/g, "");
 
killedBy: username utils normalizes and strips unsupported characters
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "abc12_3"
Received: "12_3"

[Survived] MethodExpression
utils/username.js:6:5
 export const USERNAME_REQUIREMENTS_MESSAGE = "Username must be 3-20 characters and may include lowercase letters, numbers, or underscores.";
 
 export const normalizeUsername = (value = "") =>
-    value
-        .trim()
+    value
         .toLowerCase()
         .replace(/[^a-z0-9_]/g, "");

[Killed] StringLiteral
utils/username.js:9:33
     value
         .trim()
         .toLowerCase()
-        .replace(/[^a-z0-9_]/g, "");
+        .replace(/[^a-z0-9_]/g, "Stryker was here!");
 
 export const stripToAllowedCharacters = (value = "") => normalizeUsername(value);
killedBy: username utils normalizes and strips unsupported characters
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "abc12_3"
Received: "abStryker was here!cStryker was here!12_3"

[Killed] Regex
utils/username.js:9:18
     value
         .trim()
         .toLowerCase()
-        .replace(/[^a-z0-9_]/g, "");
+        .replace(/[a-z0-9_]/g, "");
 
 export const stripToAllowedCharacters = (value = "") => normalizeUsername(value);
killedBy: username utils normalizes and strips unsupported characters
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "abc12_3"
Received: ".-"

[Killed] ArrowFunction
utils/username.js:11:41
         .toLowerCase()
         .replace(/[^a-z0-9_]/g, "");
 
-export const stripToAllowedCharacters = (value = "") => normalizeUsername(value);
+export const stripToAllowedCharacters = () => undefined;
 
 export const isValidUsername = (value = "") => USERNAME_REGEX.test(value);
killedBy: username utils normalizes and strips unsupported characters
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "__abc__"
Received: undefined

[NoCoverage] StringLiteral
utils/username.js:11:50
         .toLowerCase()
         .replace(/[^a-z0-9_]/g, "");
 
-export const stripToAllowedCharacters = (value = "") => normalizeUsername(value);
+export const stripToAllowedCharacters = (value = "Stryker was here!") => normalizeUsername(value);
 
 export const isValidUsername = (value = "") => USERNAME_REGEX.test(value);

[Killed] ArrowFunction
utils/username.js:13:32
 
 export const stripToAllowedCharacters = (value = "") => normalizeUsername(value);
 
-export const isValidUsername = (value = "") => USERNAME_REGEX.test(value);
+export const isValidUsername = () => undefined;
 
 export const isUsernameAvailable = async (username, excludeUserId) => {
killedBy: username utils validates usernames against the regex
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] BlockStatement
utils/username.js:15:71
 
 export const isValidUsername = (value = "") => USERNAME_REGEX.test(value);
 
-export const isUsernameAvailable = async (username, excludeUserId) => {
-    if (!username) return false;
-    const query = { username };
-    if (excludeUserId) {
-        query._id = { $ne: excludeUserId };
-    }
-    const existing = await User.exists(query);
-    return !existing;
-};
+export const isUsernameAvailable = async (username, excludeUserId) => {};
 
 export const buildBaseFromSeed = (seed = "") => {
killedBy: username utils returns false for empty username availability checks
statusReason: Error: expect(received).resolves.toBe(expected) // Object.is equality

Expected: false
Received: undefined

[Killed] ConditionalExpression
utils/username.js:16:9
 export const isValidUsername = (value = "") => USERNAME_REGEX.test(value);
 
 export const isUsernameAvailable = async (username, excludeUserId) => {
-    if (!username) return false;
+    if (false) return false;
     const query = { username };
     if (excludeUserId) {
killedBy: username utils returns false for empty username availability checks
statusReason: Error: expect(received).resolves.toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
utils/username.js:16:9
 export const isValidUsername = (value = "") => USERNAME_REGEX.test(value);
 
 export const isUsernameAvailable = async (username, excludeUserId) => {
-    if (!username) return false;
+    if (username) return false;
     const query = { username };
     if (excludeUserId) {
killedBy: username utils returns false for empty username availability checks
statusReason: Error: expect(received).resolves.toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
utils/username.js:18:24
 export const isUsernameAvailable = async (username, excludeUserId) => {
     if (!username) return false;
     const query = { username };
-    if (excludeUserId) {
-        query._id = { $ne: excludeUserId };
-    }
+    if (excludeUserId) {}
     const existing = await User.exists(query);
     return !existing;
killedBy: username utils checks username availability with and without excluded user id
statusReason: Error: expect(jest.fn()).toHaveBeenNthCalledWith(n, ...expected)

n: 2
Expected: {"_id": {"$ne": "user-1"}, "username": "busy_name"}
Received
       1: {"username": "free_name"}
->     2
          Object {

[Killed] ConditionalExpression
utils/username.js:18:9
 export const isUsernameAvailable = async (username, excludeUserId) => {
     if (!username) return false;
     const query = { username };
-    if (excludeUserId) {
+    if (false) {
         query._id = { $ne: excludeUserId };
     }
killedBy: username utils checks username availability with and without excluded user id
statusReason: Error: expect(jest.fn()).toHaveBeenNthCalledWith(n, ...expected)

n: 2
Expected: {"_id": {"$ne": "user-1"}, "username": "busy_name"}
Received
       1: {"username": "free_name"}
->     2
          Object {

[Killed] BooleanLiteral
utils/username.js:22:12
         query._id = { $ne: excludeUserId };
     }
     const existing = await User.exists(query);
-    return !existing;
+    return existing;
 };
 
killedBy: username utils checks username availability with and without excluded user id
statusReason: Error: expect(received).resolves.toBe(expected) // Object.is equality

Expected: true
Received: null

[Killed] BlockStatement
utils/username.js:25:49
     return !existing;
 };
 
-export const buildBaseFromSeed = (seed = "") => {
-    const cleaned = stripToAllowedCharacters(seed)
-        .replace(/_{2,}/g, "_")
-        .replace(/^_+|_+$/g, "");
-
-    if (cleaned.length >= 3) {
-        return cleaned.slice(0, 20);
-    }
-
-    const randomPart = Math.random().toString(36).replace(/[^a-z0-9]/g, "").slice(0, 6);
-    // In the extremely rare case randomPart is empty, return empty to trigger fallback in generateUsernameSuggestion
-    if (!randomPart) {
-        return "";
-    }
-    
-    const randomFallback = `user${randomPart}`;
-    return stripToAllowedCharacters(randomFallback);
-};
+export const buildBaseFromSeed = (seed = "") => {};
 
 export const ensureValidLength = (value, suffix = "") => {
killedBy: username utils builds a cleaned base from sufficiently long seeds
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "helloworld"
Received: undefined

[Survived] Regex
utils/username.js:27:18
 
 export const buildBaseFromSeed = (seed = "") => {
     const cleaned = stripToAllowedCharacters(seed)
-        .replace(/_{2,}/g, "_")
+        .replace(/_/g, "_")
         .replace(/^_+|_+$/g, "");
 

[Killed] BlockStatement
utils/username.js:30:30
         .replace(/_{2,}/g, "_")
         .replace(/^_+|_+$/g, "");
 
-    if (cleaned.length >= 3) {
-        return cleaned.slice(0, 20);
-    }
+    if (cleaned.length >= 3) {}
 
     const randomPart = Math.random().toString(36).replace(/[^a-z0-9]/g, "").slice(0, 6);
killedBy: username utils builds a cleaned base from sufficiently long seeds
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "helloworld"
Received: "user0g1xx6"

[Killed] ConditionalExpression
utils/username.js:30:9
         .replace(/_{2,}/g, "_")
         .replace(/^_+|_+$/g, "");
 
-    if (cleaned.length >= 3) {
+    if (true) {
         return cleaned.slice(0, 20);
     }
killedBy: username utils falls back to a random user seed when the cleaned seed is too short
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "user04fzzz"
Received: ""

[Killed] MethodExpression
utils/username.js:31:16
         .replace(/^_+|_+$/g, "");
 
     if (cleaned.length >= 3) {
-        return cleaned.slice(0, 20);
+        return cleaned;
     }
 
killedBy: username utils builds a cleaned base from sufficiently long seeds
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "averyveryveryverylon"
Received: "averyveryveryverylongusername"

[Killed] MethodExpression
utils/username.js:34:24
         return cleaned.slice(0, 20);
     }
 
-    const randomPart = Math.random().toString(36).replace(/[^a-z0-9]/g, "").slice(0, 6);
+    const randomPart = Math.random().toString(36).replace(/[^a-z0-9]/g, "");
     // In the extremely rare case randomPart is empty, return empty to trigger fallback in generateUsernameSuggestion
     if (!randomPart) {
killedBy: username utils falls back to a random user seed when the cleaned seed is too short
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "user04fzzz"
Received: "user04fzzzxjylrx"

[Killed] BooleanLiteral
utils/username.js:36:9
 
     const randomPart = Math.random().toString(36).replace(/[^a-z0-9]/g, "").slice(0, 6);
     // In the extremely rare case randomPart is empty, return empty to trigger fallback in generateUsernameSuggestion
-    if (!randomPart) {
+    if (randomPart) {
         return "";
     }
killedBy: username utils falls back to a random user seed when the cleaned seed is too short
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "user04fzzz"
Received: ""

[Killed] ConditionalExpression
utils/username.js:36:9
 
     const randomPart = Math.random().toString(36).replace(/[^a-z0-9]/g, "").slice(0, 6);
     // In the extremely rare case randomPart is empty, return empty to trigger fallback in generateUsernameSuggestion
-    if (!randomPart) {
+    if (true) {
         return "";
     }
killedBy: username utils falls back to a random user seed when the cleaned seed is too short
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "user04fzzz"
Received: ""

[Killed] StringLiteral
utils/username.js:40:28
         return "";
     }
     
-    const randomFallback = `user${randomPart}`;
+    const randomFallback = ``;
     return stripToAllowedCharacters(randomFallback);
 };
killedBy: username utils falls back to a random user seed when the cleaned seed is too short
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "user04fzzz"
Received: ""

[Killed] BlockStatement
utils/username.js:44:58
     return stripToAllowedCharacters(randomFallback);
 };
 
-export const ensureValidLength = (value, suffix = "") => {
-    const trimmedBase = value.slice(0, Math.max(3, 20 - suffix.length));
-    return `${trimmedBase}${suffix}`;
-};
+export const ensureValidLength = (value, suffix = "") => {};
 
 export const generateUsernameSuggestion = async (seed = "") => {
killedBy: username utils preserves suffixes while enforcing the maximum length
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "abcdefghijklmnopqr99"
Received: undefined

[NoCoverage] StringLiteral
utils/username.js:44:51
     return stripToAllowedCharacters(randomFallback);
 };
 
-export const ensureValidLength = (value, suffix = "") => {
+export const ensureValidLength = (value, suffix = "Stryker was here!") => {
     const trimmedBase = value.slice(0, Math.max(3, 20 - suffix.length));
     return `${trimmedBase}${suffix}`;

[Killed] MethodExpression
utils/username.js:45:40
 };
 
 export const ensureValidLength = (value, suffix = "") => {
-    const trimmedBase = value.slice(0, Math.max(3, 20 - suffix.length));
+    const trimmedBase = value.slice(0, Math.min(3, 20 - suffix.length));
     return `${trimmedBase}${suffix}`;
 };
killedBy: username utils preserves suffixes while enforcing the maximum length
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "abcdefghijklmnopqr99"
Received: "abc99"

[Killed] MethodExpression
utils/username.js:45:25
 };
 
 export const ensureValidLength = (value, suffix = "") => {
-    const trimmedBase = value.slice(0, Math.max(3, 20 - suffix.length));
+    const trimmedBase = value;
     return `${trimmedBase}${suffix}`;
 };
killedBy: username utils preserves suffixes while enforcing the maximum length
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "abcdefghijklmnopqr99"
Received: "abcdefghijklmnopqrst99"

[Killed] StringLiteral
utils/username.js:46:12
 
 export const ensureValidLength = (value, suffix = "") => {
     const trimmedBase = value.slice(0, Math.max(3, 20 - suffix.length));
-    return `${trimmedBase}${suffix}`;
+    return ``;
 };
 
killedBy: username utils preserves suffixes while enforcing the maximum length
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "abcdefghijklmnopqr99"
Received: ""

[Killed] BlockStatement
utils/username.js:49:64
     return `${trimmedBase}${suffix}`;
 };
 
-export const generateUsernameSuggestion = async (seed = "") => {
-    let base = buildBaseFromSeed(seed);
-    if (!base) {
-        base = "user";
-    }
-
-    base = base.slice(0, 20);
-
-    let candidate = base;
-    let attempt = 0;
-
-    while (attempt < 1000) {
-        const suffix = attempt === 0 ? "" : attempt.toString();
-        const current = ensureValidLength(base, suffix);
-        if (isValidUsername(current) && await isUsernameAvailable(current)) {
-            return current;
-        }
-        attempt += 1;
-    }
-
-    throw new Error("Unable to generate an available username.");
-};
+export const generateUsernameSuggestion = async (seed = "") => {};
 
killedBy: username utils generates the first available candidate
statusReason: Error: expect(received).resolves.toBe(expected) // Object.is equality

Expected: "writername1"
Received: undefined

[Killed] ConditionalExpression
utils/username.js:51:9
 
 export const generateUsernameSuggestion = async (seed = "") => {
     let base = buildBaseFromSeed(seed);
-    if (!base) {
+    if (true) {
         base = "user";
     }
killedBy: username utils generates the first available candidate
statusReason: Error: expect(received).resolves.toBe(expected) // Object.is equality

Expected: "writername1"
Received: "user1"

[Killed] BooleanLiteral
utils/username.js:51:9
 
 export const generateUsernameSuggestion = async (seed = "") => {
     let base = buildBaseFromSeed(seed);
-    if (!base) {
+    if (base) {
         base = "user";
     }
killedBy: username utils generates the first available candidate
statusReason: Error: expect(received).resolves.toBe(expected) // Object.is equality

Expected: "writername1"
Received: "user1"

[NoCoverage] StringLiteral
utils/username.js:52:16
 export const generateUsernameSuggestion = async (seed = "") => {
     let base = buildBaseFromSeed(seed);
     if (!base) {
-        base = "user";
+        base = "";
     }
 

[Survived] MethodExpression
utils/username.js:55:12
         base = "user";
     }
 
-    base = base.slice(0, 20);
+    base = base;
 
     let candidate = base;

[Killed] EqualityOperator
utils/username.js:60:12
     let candidate = base;
     let attempt = 0;
 
-    while (attempt < 1000) {
+    while (attempt <= 1000) {
         const suffix = attempt === 0 ? "" : attempt.toString();
         const current = ensureValidLength(base, suffix);
killedBy: username utils throws when no candidate becomes available within the retry limit
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1000
Received number of calls: 1001

[Killed] EqualityOperator
utils/username.js:60:12
     let candidate = base;
     let attempt = 0;
 
-    while (attempt < 1000) {
+    while (attempt >= 1000) {
         const suffix = attempt === 0 ? "" : attempt.toString();
         const current = ensureValidLength(base, suffix);
killedBy: username utils generates the first available candidate
statusReason: Error: expect(received).resolves.toBe()

Received promise rejected instead of resolved
Rejected to value: [Error: Unable to generate an available username.]

[Killed] ConditionalExpression
utils/username.js:61:24
     let attempt = 0;
 
     while (attempt < 1000) {
-        const suffix = attempt === 0 ? "" : attempt.toString();
+        const suffix = true ? "" : attempt.toString();
         const current = ensureValidLength(base, suffix);
         if (isValidUsername(current) && await isUsernameAvailable(current)) {
killedBy: username utils generates the first available candidate
statusReason: Error: expect(received).resolves.toBe(expected) // Object.is equality

Expected: "writername1"
Received: "writername"

[Killed] EqualityOperator
utils/username.js:61:24
     let attempt = 0;
 
     while (attempt < 1000) {
-        const suffix = attempt === 0 ? "" : attempt.toString();
+        const suffix = attempt !== 0 ? "" : attempt.toString();
         const current = ensureValidLength(base, suffix);
         if (isValidUsername(current) && await isUsernameAvailable(current)) {
killedBy: username utils generates the first available candidate
statusReason: Error: expect(received).resolves.toBe(expected) // Object.is equality

Expected: "writername1"
Received: "writername"

[Killed] LogicalOperator
utils/username.js:63:13
     while (attempt < 1000) {
         const suffix = attempt === 0 ? "" : attempt.toString();
         const current = ensureValidLength(base, suffix);
-        if (isValidUsername(current) && await isUsernameAvailable(current)) {
+        if (isValidUsername(current) || (await isUsernameAvailable(current))) {
             return current;
         }
killedBy: username utils generates the first available candidate
statusReason: Error: expect(received).resolves.toBe(expected) // Object.is equality

Expected: "writername1"
Received: "writername"

[Killed] ConditionalExpression
utils/username.js:63:13
     while (attempt < 1000) {
         const suffix = attempt === 0 ? "" : attempt.toString();
         const current = ensureValidLength(base, suffix);
-        if (isValidUsername(current) && await isUsernameAvailable(current)) {
+        if (true) {
             return current;
         }
killedBy: username utils generates the first available candidate
statusReason: Error: expect(received).resolves.toBe(expected) // Object.is equality

Expected: "writername1"
Received: "writername"

[Timeout] AssignmentOperator
utils/username.js:66:9
         if (isValidUsername(current) && await isUsernameAvailable(current)) {
             return current;
         }
-        attempt += 1;
+        attempt -= 1;
     }
 
