[Survived] ConditionalExpression
utils/Otp.js:3:35
 import OtpCode from "../models/OtpCode.model.js";
 
-const OTP_EXPIRY_MINUTES = Number(process.env.OTP_EXPIRY_MINUTES || 5);
+const OTP_EXPIRY_MINUTES = Number(false);
 const RESEND_INTERVAL_MINUTES = Number(process.env.OTP_RESEND_INTERVAL_MINUTES) || 1;
 

[Survived] ConditionalExpression
utils/Otp.js:3:35
 import OtpCode from "../models/OtpCode.model.js";
 
-const OTP_EXPIRY_MINUTES = Number(process.env.OTP_EXPIRY_MINUTES || 5);
+const OTP_EXPIRY_MINUTES = Number(true);
 const RESEND_INTERVAL_MINUTES = Number(process.env.OTP_RESEND_INTERVAL_MINUTES) || 1;
 

[Killed] ConditionalExpression
utils/Otp.js:4:33
 import OtpCode from "../models/OtpCode.model.js";
 
 const OTP_EXPIRY_MINUTES = Number(process.env.OTP_EXPIRY_MINUTES || 5);
-const RESEND_INTERVAL_MINUTES = Number(process.env.OTP_RESEND_INTERVAL_MINUTES) || 1;
+const RESEND_INTERVAL_MINUTES = false;
 
 const minutesToMs = mins => mins * 60 * 1000;
killedBy: OTP utils canResendOtp enforces the resend interval
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Survived] LogicalOperator
utils/Otp.js:4:33
 import OtpCode from "../models/OtpCode.model.js";
 
 const OTP_EXPIRY_MINUTES = Number(process.env.OTP_EXPIRY_MINUTES || 5);
-const RESEND_INTERVAL_MINUTES = Number(process.env.OTP_RESEND_INTERVAL_MINUTES) || 1;
+const RESEND_INTERVAL_MINUTES = Number(process.env.OTP_RESEND_INTERVAL_MINUTES) && 1;
 
 const minutesToMs = mins => mins * 60 * 1000;

[Killed] ArithmeticOperator
utils/Otp.js:6:29
 const OTP_EXPIRY_MINUTES = Number(process.env.OTP_EXPIRY_MINUTES || 5);
 const RESEND_INTERVAL_MINUTES = Number(process.env.OTP_RESEND_INTERVAL_MINUTES) || 1;
 
-const minutesToMs = mins => mins * 60 * 1000;
+const minutesToMs = mins => mins * 60 / 1000;
 
 export const generateOtp = () => {
killedBy: OTP utils canResendOtp enforces the resend interval
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ArithmeticOperator
utils/Otp.js:6:29
 const OTP_EXPIRY_MINUTES = Number(process.env.OTP_EXPIRY_MINUTES || 5);
 const RESEND_INTERVAL_MINUTES = Number(process.env.OTP_RESEND_INTERVAL_MINUTES) || 1;
 
-const minutesToMs = mins => mins * 60 * 1000;
+const minutesToMs = mins => mins / 60 * 1000;
 
 export const generateOtp = () => {
killedBy: OTP utils canResendOtp enforces the resend interval
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
utils/Otp.js:8:34
 
 const minutesToMs = mins => mins * 60 * 1000;
 
-export const generateOtp = () => {
-    return Math.floor(100000 + Math.random() * 900000).toString();
-};
+export const generateOtp = () => {};
 
 export const createAndSendOtp = async ({ email, pendingUser, sendEmailFn }) => {
killedBy: OTP utils generates a six digit OTP string
statusReason: TypeError: expect(received).toMatch(expected)

Matcher error: received value must be a string

Received has value: undefined

[Killed] ArithmeticOperator
utils/Otp.js:9:23
 const minutesToMs = mins => mins * 60 * 1000;
 
 export const generateOtp = () => {
-    return Math.floor(100000 + Math.random() * 900000).toString();
+    return Math.floor(100000 - Math.random() * 900000).toString();
 };
 
killedBy: OTP utils generates a six digit OTP string
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /^\d{6}$/
Received string:  "-117044"

[Survived] ArithmeticOperator
utils/Otp.js:9:32
 const minutesToMs = mins => mins * 60 * 1000;
 
 export const generateOtp = () => {
-    return Math.floor(100000 + Math.random() * 900000).toString();
+    return Math.floor(100000 + Math.random() / 900000).toString();
 };
 

[Killed] BooleanLiteral
utils/Otp.js:13:7
 };
 
 export const createAndSendOtp = async ({ email, pendingUser, sendEmailFn }) => {
-  if (!email) {
+  if (email) {
     throw new Error("Email is required to create OTP.");
   }
killedBy: OTP utils createAndSendOtp validates required fields
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"attempts": 0, "code": "989454", "createdAt": 2026-04-26T17:09:40.439Z, "email": undefined, "expiresAt": 2026-04-26T17:14:40.439Z, "lastSentAt": 2026-04-26T17:09:40.439Z, "pendingUser": {}, "resendCount": 0, "save": [Function mockConstructor]}

[Killed] BlockStatement
utils/Otp.js:13:15
 };
 
 export const createAndSendOtp = async ({ email, pendingUser, sendEmailFn }) => {
-  if (!email) {
-    throw new Error("Email is required to create OTP.");
-  }
+  if (!email) {}
 
   if (!pendingUser) {
killedBy: OTP utils createAndSendOtp validates required fields
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"attempts": 0, "code": "683404", "createdAt": 2026-04-26T17:09:40.765Z, "email": undefined, "expiresAt": 2026-04-26T17:14:40.765Z, "lastSentAt": 2026-04-26T17:09:40.765Z, "pendingUser": {}, "resendCount": 0, "save": [Function mockConstructor]}

[Killed] StringLiteral
utils/Otp.js:14:21
 
 export const createAndSendOtp = async ({ email, pendingUser, sendEmailFn }) => {
   if (!email) {
-    throw new Error("Email is required to create OTP.");
+    throw new Error("");
   }
 
killedBy: OTP utils createAndSendOtp validates required fields
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Email is required to create OTP."
Received message:   ""

      75 |       } else {
      76 |         stryCov_9fa48("17");
    > 77 |         throw new Error(stryMutAct_9fa48("18") ? "" : (stryCov_9fa48("18"), "Email is required to create OTP."));

[Killed] BooleanLiteral
utils/Otp.js:17:7
     throw new Error("Email is required to create OTP.");
   }
 
-  if (!pendingUser) {
+  if (pendingUser) {
     throw new Error("Pending user payload is required to create OTP.");
   }
killedBy: OTP utils createAndSendOtp validates required fields
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"attempts": 0, "code": "679638", "createdAt": 2026-04-26T17:09:40.682Z, "email": "test@example.com", "expiresAt": 2026-04-26T17:14:40.682Z, "lastSentAt": 2026-04-26T17:09:40.682Z, "pendingUser": undefined, "resendCount": 0, "save": [Function mockConstructor]}

[Killed] ConditionalExpression
utils/Otp.js:17:7
     throw new Error("Email is required to create OTP.");
   }
 
-  if (!pendingUser) {
+  if (false) {
     throw new Error("Pending user payload is required to create OTP.");
   }
killedBy: OTP utils createAndSendOtp validates required fields
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"attempts": 0, "code": "580534", "createdAt": 2026-04-26T17:09:41.054Z, "email": "test@example.com", "expiresAt": 2026-04-26T17:14:41.054Z, "lastSentAt": 2026-04-26T17:09:41.054Z, "pendingUser": undefined, "resendCount": 0, "save": [Function mockConstructor]}

[Survived] ArithmeticOperator
utils/Otp.js:23:30
 
   const code = generateOtp();
   const now = new Date();
-  const expiresAt = new Date(now.getTime() + minutesToMs(OTP_EXPIRY_MINUTES));
+  const expiresAt = new Date(now.getTime() - minutesToMs(OTP_EXPIRY_MINUTES));
 
   let otpDoc = await OtpCode.findOne({ email });

[Killed] BooleanLiteral
utils/Otp.js:27:7
 
   let otpDoc = await OtpCode.findOne({ email });
 
-  if (!otpDoc) {
+  if (otpDoc) {
     otpDoc = new OtpCode({ email });
   }
killedBy: OTP utils createAndSendOtp creates a new OTP document and sends email
statusReason: TypeError: Cannot set properties of null (setting 'code')

[Killed] ConditionalExpression
utils/Otp.js:27:7
 
   let otpDoc = await OtpCode.findOne({ email });
 
-  if (!otpDoc) {
+  if (false) {
     otpDoc = new OtpCode({ email });
   }
killedBy: OTP utils createAndSendOtp creates a new OTP document and sends email
statusReason: TypeError: Cannot set properties of null (setting 'code')

[Killed] ObjectLiteral
utils/Otp.js:28:26
   let otpDoc = await OtpCode.findOne({ email });
 
   if (!otpDoc) {
-    otpDoc = new OtpCode({ email });
+    otpDoc = new OtpCode({});
   }
 
killedBy: OTP utils createAndSendOtp creates a new OTP document and sends email
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "email": "test@example.com",
- }

[Killed] BlockStatement
utils/Otp.js:41:42
 
   await otpDoc.save();
 
-  if (typeof sendEmailFn === "function") {
-    await sendEmailFn({ email, code, expiresAt });
-  }
+  if (typeof sendEmailFn === "function") {}
 
   return otpDoc;
killedBy: OTP utils createAndSendOtp creates a new OTP document and sends email
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"code": "100000", "email": "test@example.com"}

Number of calls: 0

[Killed] ConditionalExpression
utils/Otp.js:41:7
 
   await otpDoc.save();
 
-  if (typeof sendEmailFn === "function") {
+  if (false) {
     await sendEmailFn({ email, code, expiresAt });
   }
killedBy: OTP utils createAndSendOtp creates a new OTP document and sends email
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"code": "100000", "email": "test@example.com"}

Number of calls: 0

[Killed] ObjectLiteral
utils/Otp.js:42:23
   await otpDoc.save();
 
   if (typeof sendEmailFn === "function") {
-    await sendEmailFn({ email, code, expiresAt });
+    await sendEmailFn({});
   }
 
killedBy: OTP utils createAndSendOtp creates a new OTP document and sends email
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"code": "100000", "email": "test@example.com"}
Received: {}

Number of calls: 1

[Killed] BlockStatement
utils/Otp.js:48:41
   return otpDoc;
 };
 
-export const canResendOtp = (otpDoc) => {
-  if (!otpDoc) return true; // no previous OTP => can send
-  const now = Date.now();
-  const lastSent = new Date(otpDoc.lastSentAt).getTime();
-  return now - lastSent >= minutesToMs(RESEND_INTERVAL_MINUTES);
-};
+export const canResendOtp = (otpDoc) => {};
 
 export const resendOtp = async ({ email, sendEmailFn }) => {
killedBy: OTP utils canResendOtp enforces the resend interval
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] BooleanLiteral
utils/Otp.js:49:7
 };
 
 export const canResendOtp = (otpDoc) => {
-  if (!otpDoc) return true; // no previous OTP => can send
+  if (otpDoc) return true; // no previous OTP => can send
   const now = Date.now();
   const lastSent = new Date(otpDoc.lastSentAt).getTime();
killedBy: OTP utils canResendOtp enforces the resend interval
statusReason: TypeError: Cannot read properties of null (reading 'lastSentAt')

[Killed] BooleanLiteral
utils/Otp.js:49:23
 };
 
 export const canResendOtp = (otpDoc) => {
-  if (!otpDoc) return true; // no previous OTP => can send
+  if (!otpDoc) return false; // no previous OTP => can send
   const now = Date.now();
   const lastSent = new Date(otpDoc.lastSentAt).getTime();
killedBy: OTP utils canResendOtp enforces the resend interval
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
utils/Otp.js:52:10
   if (!otpDoc) return true; // no previous OTP => can send
   const now = Date.now();
   const lastSent = new Date(otpDoc.lastSentAt).getTime();
-  return now - lastSent >= minutesToMs(RESEND_INTERVAL_MINUTES);
+  return true;
 };
 
killedBy: OTP utils canResendOtp enforces the resend interval
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
utils/Otp.js:52:10
   if (!otpDoc) return true; // no previous OTP => can send
   const now = Date.now();
   const lastSent = new Date(otpDoc.lastSentAt).getTime();
-  return now - lastSent >= minutesToMs(RESEND_INTERVAL_MINUTES);
+  return now - lastSent < minutesToMs(RESEND_INTERVAL_MINUTES);
 };
 
killedBy: OTP utils canResendOtp enforces the resend interval
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
utils/Otp.js:59:16
   const otpDoc = await OtpCode.findOne({ email });
   const now = new Date();
 
-  if (!otpDoc) {
-    const err = new Error("No pending verification found for this email. Please register again.");
-    err.code = "OTP_NOT_FOUND";
-    throw err;
-  }
+  if (!otpDoc) {}
 
   if (!canResendOtp(otpDoc)) {
killedBy: OTP utils resendOtp throws when no pending OTP exists
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 3
+ Received  + 1

- Object {
-   "code": "OTP_NOT_FOUND",
- }

[Killed] ConditionalExpression
utils/Otp.js:65:7
     throw err;
   }
 
-  if (!canResendOtp(otpDoc)) {
+  if (false) {
     const waitMs = minutesToMs(RESEND_INTERVAL_MINUTES) - (Date.now() - new Date(otpDoc.lastSentAt).getTime());
     const waitSeconds = Math.ceil(waitMs / 1000);
killedBy: OTP utils resendOtp throws when the resend window has not passed
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 3
+ Received  + 1

- Object {
-   "code": "RESEND_TOO_SOON",
- }

[Killed] BooleanLiteral
utils/Otp.js:65:7
     throw err;
   }
 
-  if (!canResendOtp(otpDoc)) {
+  if (canResendOtp(otpDoc)) {
     const waitMs = minutesToMs(RESEND_INTERVAL_MINUTES) - (Date.now() - new Date(otpDoc.lastSentAt).getTime());
     const waitSeconds = Math.ceil(waitMs / 1000);
killedBy: OTP utils resendOtp throws when the resend window has not passed
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 3
+ Received  + 1

- Object {
-   "code": "RESEND_TOO_SOON",
- }

[Survived] ArithmeticOperator
utils/Otp.js:66:20
   }
 
   if (!canResendOtp(otpDoc)) {
-    const waitMs = minutesToMs(RESEND_INTERVAL_MINUTES) - (Date.now() - new Date(otpDoc.lastSentAt).getTime());
+    const waitMs = minutesToMs(RESEND_INTERVAL_MINUTES) + (Date.now() - new Date(otpDoc.lastSentAt).getTime());
     const waitSeconds = Math.ceil(waitMs / 1000);
     const err = new Error(`Resend allowed after ${waitSeconds} second(s).`);

[Survived] ArithmeticOperator
utils/Otp.js:66:60
   }
 
   if (!canResendOtp(otpDoc)) {
-    const waitMs = minutesToMs(RESEND_INTERVAL_MINUTES) - (Date.now() - new Date(otpDoc.lastSentAt).getTime());
+    const waitMs = minutesToMs(RESEND_INTERVAL_MINUTES) - (Date.now() + new Date(otpDoc.lastSentAt).getTime());
     const waitSeconds = Math.ceil(waitMs / 1000);
     const err = new Error(`Resend allowed after ${waitSeconds} second(s).`);

[Survived] ArithmeticOperator
utils/Otp.js:67:35
 
   if (!canResendOtp(otpDoc)) {
     const waitMs = minutesToMs(RESEND_INTERVAL_MINUTES) - (Date.now() - new Date(otpDoc.lastSentAt).getTime());
-    const waitSeconds = Math.ceil(waitMs / 1000);
+    const waitSeconds = Math.ceil(waitMs * 1000);
     const err = new Error(`Resend allowed after ${waitSeconds} second(s).`);
     err.code = "RESEND_TOO_SOON";

[Survived] StringLiteral
utils/Otp.js:68:27
   if (!canResendOtp(otpDoc)) {
     const waitMs = minutesToMs(RESEND_INTERVAL_MINUTES) - (Date.now() - new Date(otpDoc.lastSentAt).getTime());
     const waitSeconds = Math.ceil(waitMs / 1000);
-    const err = new Error(`Resend allowed after ${waitSeconds} second(s).`);
+    const err = new Error(``);
     err.code = "RESEND_TOO_SOON";
     err.waitSeconds = waitSeconds;

[Survived] ArithmeticOperator
utils/Otp.js:75:30
   }
 
   const code = generateOtp();
-  const expiresAt = new Date(now.getTime() + minutesToMs(OTP_EXPIRY_MINUTES));
+  const expiresAt = new Date(now.getTime() - minutesToMs(OTP_EXPIRY_MINUTES));
   otpDoc.code = code;
   otpDoc.createdAt = now;

[Killed] ConditionalExpression
utils/Otp.js:80:25
   otpDoc.createdAt = now;
   otpDoc.expiresAt = expiresAt;
   otpDoc.lastSentAt = now;
-  otpDoc.resendCount = (otpDoc.resendCount || 0) + 1;
+  otpDoc.resendCount = (false) + 1;
 
   await otpDoc.save();
killedBy: OTP utils resendOtp refreshes the OTP and increments resendCount
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] LogicalOperator
utils/Otp.js:80:25
   otpDoc.createdAt = now;
   otpDoc.expiresAt = expiresAt;
   otpDoc.lastSentAt = now;
-  otpDoc.resendCount = (otpDoc.resendCount || 0) + 1;
+  otpDoc.resendCount = (otpDoc.resendCount && 0) + 1;
 
   await otpDoc.save();
killedBy: OTP utils resendOtp refreshes the OTP and increments resendCount
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Survived] ObjectLiteral
utils/Otp.js:92:40
 };
 
 export const verifyOtp = async ({ email, code }) => {
-  const otpDoc = await OtpCode.findOne({ email });
+  const otpDoc = await OtpCode.findOne({});
   if (!otpDoc) {
     const err = new Error("OTP not found or expired.");

[Killed] BooleanLiteral
utils/Otp.js:93:7
 
 export const verifyOtp = async ({ email, code }) => {
   const otpDoc = await OtpCode.findOne({ email });
-  if (!otpDoc) {
+  if (otpDoc) {
     const err = new Error("OTP not found or expired.");
     err.code = "OTP_NOT_FOUND";
killedBy: OTP utils verifyOtp rejects missing OTP records
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 3
+ Received  + 1

- Object {
-   "code": "OTP_NOT_FOUND",
- }

[Killed] ConditionalExpression
utils/Otp.js:93:7
 
 export const verifyOtp = async ({ email, code }) => {
   const otpDoc = await OtpCode.findOne({ email });
-  if (!otpDoc) {
+  if (true) {
     const err = new Error("OTP not found or expired.");
     err.code = "OTP_NOT_FOUND";
killedBy: OTP utils verifyOtp deletes expired OTP records
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 1
+ Received  + 1

  Object {
-   "code": "OTP_EXPIRED",
+   "code": "OTP_NOT_FOUND",

[Killed] ConditionalExpression
utils/Otp.js:99:7
     throw err;
   }
 
-  if (new Date() > otpDoc.expiresAt) {
+  if (false) {
     await OtpCode.deleteMany({ email });
     const err = new Error("OTP expired. Please request a new one.");
killedBy: OTP utils verifyOtp deletes expired OTP records
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 3
+ Received  + 1

- Object {
-   "code": "OTP_EXPIRED",
- }

[Killed] EqualityOperator
utils/Otp.js:99:7
     throw err;
   }
 
-  if (new Date() > otpDoc.expiresAt) {
+  if (new Date() <= otpDoc.expiresAt) {
     await OtpCode.deleteMany({ email });
     const err = new Error("OTP expired. Please request a new one.");
killedBy: OTP utils verifyOtp deletes expired OTP records
statusReason: Error: expect(received).rejects.toMatchObject(expected)

- Expected  - 3
+ Received  + 1

- Object {
-   "code": "OTP_EXPIRED",
- }

[Killed] BlockStatement
utils/Otp.js:106:44
     throw err;
   }
 
-  if (otpDoc.code !== String(code).trim()) {
-    otpDoc.attempts = (otpDoc.attempts || 0) + 1;
-    await otpDoc.save();
-    const err = new Error("Invalid OTP code.");
-    err.code = "INVALID_OTP";
-    throw err;
-  }
+  if (otpDoc.code !== String(code).trim()) {}
 
   const pendingUser = otpDoc.pendingUser;
killedBy: OTP utils verifyOtp increments attempts for invalid codes
statusReason: Error: expect(received).rejects.toMatchObject()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] EqualityOperator
utils/Otp.js:106:7
     throw err;
   }
 
-  if (otpDoc.code !== String(code).trim()) {
+  if (otpDoc.code === String(code).trim()) {
     otpDoc.attempts = (otpDoc.attempts || 0) + 1;
     await otpDoc.save();
killedBy: OTP utils verifyOtp increments attempts for invalid codes
statusReason: Error: expect(received).rejects.toMatchObject()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] ConditionalExpression
utils/Otp.js:107:24
   }
 
   if (otpDoc.code !== String(code).trim()) {
-    otpDoc.attempts = (otpDoc.attempts || 0) + 1;
+    otpDoc.attempts = (true) + 1;
     await otpDoc.save();
     const err = new Error("Invalid OTP code.");
killedBy: OTP utils verifyOtp increments attempts for invalid codes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 2

[Killed] ArithmeticOperator
utils/Otp.js:107:23
   }
 
   if (otpDoc.code !== String(code).trim()) {
-    otpDoc.attempts = (otpDoc.attempts || 0) + 1;
+    otpDoc.attempts = (otpDoc.attempts || 0) - 1;
     await otpDoc.save();
     const err = new Error("Invalid OTP code.");
killedBy: OTP utils verifyOtp increments attempts for invalid codes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: -1

[Killed] ObjectLiteral
utils/Otp.js:116:28
 
   const pendingUser = otpDoc.pendingUser;
 
-  await OtpCode.deleteMany({ email });
+  await OtpCode.deleteMany({});
 
   return pendingUser;
killedBy: OTP utils verifyOtp returns pending user and clears the OTP for valid codes
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "email": "test@example.com",
- }
