[Killed] BlockStatement
helpers/handleError.js:1:53
-export const handleError = (statusCode, message) => {
-    const error = new Error
-    error.statusCode = statusCode
-    error.message = message
-    return error
-}
+export const handleError = (statusCode, message) => {}
killedBy: handleError creates an Error with statusCode and message
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: Error

Received value has no prototype
Received value: undefined
